app/controllers/heroes_controller.rb

    def index
        heroes=Hero.all
---
SELECT "heros".* FROM "heros"

    def show
        hero=Hero.find(params[:id])
---
SELECT "heros".* FROM "heros" WHERE "heros"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]