app/controllers/hero_powers_controller.rb

    def index
        r=HeroPower.all
---
SELECT "hero_powers".* FROM "hero_powers"